Revit 2026 API

# RebarBendingDetailGetHost Method

---

Gets a reference to the reinforcement element that this bending detail represents.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Reference GetHost(
	Element bendingDetail
)
```
```vb
Public Shared Function GetHost (
	bendingDetail As Element
) As Reference
```
```cpp
public:
static Reference^ GetHost(
	Element^ bendingDetail
)
```
```fsharp
static member GetHost :
        bendingDetail : Element -> Reference
```

#### Parameters

bendingDetail Element
     The bending detail for which we want to get the host.

#### Return Value

Reference Returns a reference pointing to the reinforcement element represented by the input bending detail.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

RebarBendingDetail Class

Autodesk.Revit.DB.Structure Namespace